Page({
    onLoad: function(e) {
        var a = [ {
            flowImg: "https://jp.juancdn.com/xcx_images/pt_flow.png",
            flows: [ {
                key: "开团：",
                value: "选择心仪商品支付开团并邀请好友参团；"
            }, {
                key: "参团：",
                value: "进入朋友分享的页面，点击“立即参团”按钮，付款后即参团成功；"
            }, {
                key: "拼团成功：",
                value: "开团或参团成功后，在24小时内达到指定人数，则拼团成功。系统将生成订单，由商家安排发货。您可在“我的拼团”内查看订单发货进度；"
            }, {
                key: "拼团失败：",
                value: "团长开团24小时内未达指定人数，则拼团失败，将退还支付款项；"
            }, {
                key: "退款：",
                value: "拼团退款将在1-12个工作日内安排退至原支付账户/卷皮钱包，具体到账时间以(卷皮钱包/支付宝/微信/银行)为准，请注意查收。 退款进度可在“我的拼团”内查看。"
            }, {
                key: "创建订单失败：",
                value: "拼团商品数量有限，先成团先得。商品被抢光后，将无法再创建发货订单或开/参团。所以成团要趁早喔~"
            }, {
                key: "卷皮APP新用户专享商品：",
                value: "新用户是指首次使用卷皮APP的卷皮用户。新用户需同时满足新注册，新设备、新注册手机号、新交易账户、新收货地址等条件方可参团享受优惠。卷皮保留对新用户定义随时修订的权利。"
            } ]
        }, {
            flowImg: "https://jp.juancdn.com/xcx_images/pt_flow_lottery.png",
            flows: [ {
                key: "开团：",
                value: "选择心仪商品支付开团并邀请好友参加；"
            }, {
                key: "参团：",
                value: "进入朋友分享的页面，点击“立即参团”按钮，付款后即参团成功；"
            }, {
                key: "开奖：",
                value: "抽奖商品开奖后，您可以在“我的拼团”内查看中奖名单。系统将生成中奖用户订单，由商家安排发货。您可以在“我的订单”内查看订单发货进度；"
            }, {
                key: "抽奖拼团失败：",
                value: "团长开团24小时内未达指定人数，则拼团失败，将退还支付款项；"
            }, {
                key: "退款：",
                value: "拼团退款将在1-12个工作日内安排退至原支付账户/卷皮钱包，具体到账时间以(卷皮钱包/支付宝/微信/银行)为准，请注意查收。 退款进度可在“我的拼团”内查看。"
            } ]
        }, {
            flows: [ "1.1元拼活动仅限卷皮新用户参团购买（开团者无身份限制）；", "2.新用户指在卷皮无历史购买记录和订单记录（包括拼团与非拼团订单）的用户；", "3.活动商品库存有限，同一拼团商品针对同一用户限购，不同商品限购数量不同；", "4.1元拼活动不与其他活动同时参与，不能使用优惠券；", "5.收货电话需与注册电话保持一致，订单地址异常可视情况关闭订单；", "6.同一登录账号、同一手机号、同一终端设备、同一支付账号、同一收货地址等合理显示为同一用户的情形，均视为同一用户；", "7.为确保广大卷皮用户能公平参与活动，凡使用包括但不限于伪造个人信息等手段作弊的订单，卷皮有权取消订单；" ]
        }, {
            flows: [ "1．在【卷皮9.9五周年庆】活动期间，新、老用户均可参与活动。活动期间每个用户每天可开团4次，同一用户整个活动期间参团次数仅限1次。特价商品库存有限，先到先得，以支付成功后系统提示来判定是否拼团成功，部分商品抢完恢复原价。", "2．拼团订单收货电话必须与注册电话一致,收货地址异常订单视情况关闭。", "3．同一登录账号、同一手机号、同一终端设备、同一支付账号、同一收货地址等合理显示为同一用户的情形，均视为同一用户。", "4．活动期间，凡以不正常手段（包括但不限于作弊、虚假交易、扰乱系统、恶意刷单、实施网络攻击等）参与本次活动的用户，卷皮有权终止其参与活动的资格。", "5．在法律允许范围内，卷皮对活动期间的各项规则保留最终解释权。" ]
        } ], l = e.type && e.type < 4 ? e.type : 0, t = a[l];
        t.type = l, this.setData(t);
    }
});